In [2]:
lang = 'bar'

import pandas as pd

In [7]:
df = pd.read_csv(f'{lang}_freq.csv',header=None)
df.columns = [lang,'f']
df.head()

      bar       f
0      de  109115
1   indus      40
2  kuitua     427
3       ,  154197
4     dt.    2128

In [10]:
l = [0.75, 0.85, 0.95]
q = df['f'].quantile(l)
q

0.75     2.0
0.85     4.0
0.95    13.0
Name: f, dtype: float64

In [14]:
sample = df[df['f'] <= q[l[0]]]
q1 = sample.sample(200)
q1['q']=1

sample = df[(df['f'] <q[l[0]]) (df['f'] <= q[l[1]])]
q1 = sample.sample(200)
q1['q']=1

                              bar  f  q
105788                    rodauer  1  1
226291                limburg-süd  1  1
148378                    eiwärts  1  1
205388  femundsmarka-nationalpark  1  1
118489                  eignkiach  1  1
...                           ... .. ..
278856                woppnschild  1  1
333152                      kiepe  1  1
185027             sklavenhaltnde  1  1
352309                   thalmayr  1  1
128570                 fantasivoi  1  1

[200 rows x 3 columns]